{
	"percentage": 75,
	"logs": [
		{
			"id": 1,
			"title": "Avance #1",
			"date": "2024/08/29",
			"summary": "Hoy iniciamos el proyecto para desarrollar un robot autónomo capaz de resolver laberintos utilizando micro:bits. En esta etapa, nos enfocamos en la conceptualización de la idea y la identificación de los materiales necesarios.",
			"tasks": [
				{
					"title": "Diseño y montaje",
					"advancements": [
						"Se realizó una lluvia de ideas sobre el objetivo del proyecto.",
						"Se discutieron y anotaron los materiales y componentes necesarios para el desarrollo del robot."
					],
					"status": "completed"
				},
				{
					"title": "Programación",
					"code": {
						"advancements": [
							"No se ha desarrollado código en esta etapa, ya que el enfoque ha sido sobre la conceptualización del proyecto."
						],
						"status": "pending"
					},
					"tests": {
						"advancements": [
							"No se han realizado pruebas aún debido a que el proyecto está en la fase inicial de planificación."
						],
						"status": "pending"
					}
				}
			],
			"issues": [
				{
					"title": "Descripción de problemas",
					"description": "No se han identificado problemas específicos en esta etapa, ya que el proyecto está en fase de planificación."
				},
				{
					"title": "Impacto en el proyecto",
					"description": "No aplicable en esta fase."
				},
				{
					"title": "Acciones tomadas",
					"description": "Se ha creado un plan para investigar y adquirir los materiales necesarios."
				}
			],
			"nextSteps": [
				{
					"title": "Tareas planeadas",
					"advancements": [
						"Investigación y adquisición de materiales. Continuar con la investigación sobre los componentes necesarios y comenzar la adquisición de los mismos.",
						"Diseño detallado. Empezar a desarrollar el diseño detallado del robot y del circuito.",
						"Preparación del entorno de programación. Configurar el entorno necesario para la programación del micro:bit."
					]
				},
				{
					"title": "Cronograma revisado",
					"calendar": [
						{
							"date": "2024/09/20",
							"title": "Adquisición de materiales"
						},
						{
							"date": "2024/09/30",
							"title": "Diseño detallado"
						}
					]
				}
			],
			"resources": [
				{
					"title": "Recursos requeridos",
					"advancements": [
						"Materiales para el robot (micro:bit, sensores, motores, baterías, etc.).",
						"Herramientas para el montaje y programación."
					]
				}
			],
			"comments": [
				{
					"title": "Retroalimentación del equipo",
					"advancements": [
						"El equipo está entusiasmado con el inicio del proyecto y está colaborando en la investigación de los materiales necesarios."
					]
				},
				{
					"title": "Sugerencias de mejora",
					"advancements": [
						"Definir un cronograma más detallado para las siguientes fases del proyecto para asegurar una transición fluida entre planificación y desarrollo."
					]
				}
			],
			"attachments": null
		},
		{
			"id": 2,
			"title": "Avance #2",
			"date": "2024/09/06",
			"summary": "Hoy hemos avanzado en la definición formal del proyecto. Se establecieron el nombre del proyecto, los materiales a utilizar, el alcance del proyecto, y se asignaron los roles dentro del equipo.",
			"tasks": [
				{
					"title": "Diseño y montaje",
					"advancements": [
						"Nombre del proyecto definido como AMazedBot",
						[
							"Se determinó una lista preliminar de materiales que incluirá",
							"Micro:bit: x2",
							"Motor con rueda: x2",
							"Sensor ultrasónico: x3",
							"Protoboard: x1",
							"Batería: x1",
							"Cables: xN"
						],
						"Se definió el objetivo principal, que es desarrollar un robot que pueda navegar por un laberinto de forma autónoma.",
						[
							"Se asignaron roles a los miembros del equipo",
							"Gian Luca Porto: Project Manager",
							"Mateo Moreira: Secretario",
							"Ignacio Carvallo: Líder Técnico",
							"Sofía da Silva: Líder Artístico"
						]
					],
					"status": "completed"
				},
				{
					"title": "Programación",
					"code": {
						"advancements": [
							"No se ha desarrollado código en esta etapa, ya que el enfoque ha sido la definición del proyecto y la planificación."
						],
						"status": "pending"
					},
					"tests": {
						"advancements": [
							"No se han realizado pruebas aún debido a que el proyecto está en la fase inicial de planificación."
						],
						"status": "pending"
					}
				}
			],
			"issues": [
				{
					"title": "Descripción de problemas",
					"description": "No se han identificado problemas específicos en esta etapa de definición del proyecto."
				},
				{
					"title": "Impacto en el proyecto",
					"description": "No aplicable en esta fase."
				},
				{
					"title": "Acciones tomadas",
					"description": "Se ha establecido una base sólida para continuar con las siguientes fases del proyecto."
				}
			],
			"nextSteps": [
				{
					"title": "Tareas planeadas",
					"advancements": [
						"Proceder con la compra de los componentes restantes.",
						"Iniciar el diseño detallado del robot y el sistema de control.",
						"Comenzar la configuración del entorno de programación y desarrollo del código básico."
					]
				},
				{
					"title": "Cronograma revisado",
					"calendar": [
						{
							"date": "2024/09/20",
							"title": "Adquisición de materiales"
						},
						{
							"date": "2024/09/30",
							"title": "Diseño detallado"
						}
					]
				}
			],
			"resources": [
				{
					"title": "Recursos requeridos",
					"advancements": [
						"Compra de materiales y componentes necesarios para el robot.",
						"Herramientas de diseño y programación"
					]
				}
			],
			"comments": [
				{
					"title": "Retroalimentación del equipo",
					"advancements": [
						"El equipo está satisfecho con el progreso realizado y está listo para avanzar a las siguientes fases."
					]
				},
				{
					"title": "Sugerencias de mejora",
					"advancements": [
						"Asegurarse de que todos los miembros del equipo tengan acceso a la documentación del proyecto y a los recursos necesarios."
					]
				}
			],
			"attachments": null
		},
		{
			"id": 3,
			"title": "Avance #3",
			"date": "2024/09/13",
			"summary": "Se realizaron importantes avances en el diseño del laberinto y la verificación de los componentes electrónicos. Además, se comenzaron a evaluar costos de materiales y posibles proveedores. También se avanzó en la implementación de código utilizando la página de microbit.org, aunque surgieron problemas con la potencia de las baterías.",
			"tasks": [
				{
					"title": "Diseño y montaje",
					"advancements": [
						"Se diseñó el laberinto utilizando mazedgenerator.net y se comenzó la evaluación de los materiales que se necesitarán.",
						"Se investigó el costo de cortar el laberinto en MDF mediante láser.",
						"Se verificaron los componentes disponibles y su correcto funcionamiento.",
						"Diseño del chasis del robot (pendiente).",
						"Se evaluó la necesidad de comprar materiales adicionales, incluyendo costos y lugares donde adquirirlos."
					],
					"status": "active"
				},
				{
					"title": "Programación",
					"code": {
						"advancements": [
							"Se utilizó la página microbit.org para iniciar el desarrollo del código. Sin embargo, el circuito no funcionó como se esperaba debido a la insuficiente potencia de las baterías. Las actuales proporcionaban 3V cuando se requerían 5V."
						],
						"status": "pending"
					},
					"tests": {
						"advancements": [
							"Se verificaron los componentes electrónicos y se detectó que la falta de potencia en las baterías impidió el correcto funcionamiento del circuito."
						],
						"status": "pending"
					}
				}
			],
			"issues": [
				{
					"title": "Descripción de problemas",
					"description": "El principal problema identificado fue la insuficiente potencia en las baterías, lo que afectó el funcionamiento del circuito."
				},
				{
					"title": "Impacto en el proyecto",
					"description": "Se retrasó el avance en la programación y en las pruebas del circuito."
				},
				{
					"title": "Acciones tomadas",
					"description": "Se está evaluando la compra de baterías con mayor voltaje (5V) para solucionar el problema."
				}
			],
			"nextSteps": [
				{
					"title": "Tareas planeadas",
					"advancements": [
						"Continuar con el diseño del robot, específicamente su chasis.",
						"Adquirir baterías adecuadas (5V) para continuar con el desarrollo del circuito.",
						"Realizar pruebas adicionales una vez que se obtengan las baterías correctas.",
						"Proceder con la compra de los materiales necesarios y la evaluación de los costos de corte láser."
					]
				},
				{
					"title": "Cronograma revisado",
					"calendar": [
						{
							"date": "2024/09/20",
							"title": "Adquisición de materiales"
						},
						{
							"date": "2024/09/30",
							"title": "Diseño detallado"
						}
					]
				}
			],
			"resources": [
				{
					"title": "Recursos utilizados",
					"advancements": [
						"Herramientas de diseño y programación (Tinkercad, Blender).",
						"https://microbit.org/"
					]
				}
			],
			"comments": [
				{
					"title": "Retroalimentación del equipo",
					"advancements": [
						"El equipo está avanzando en varias áreas a la vez, pero es crucial resolver los problemas de potencia para continuar con el desarrollo del robot."
					]
				},
				{
					"title": "Sugerencias de mejora",
					"advancements": [
						"Es importante continuar evaluando costos y asegurarse de que todos los componentes electrónicos funcionen correctamente antes de proceder con compras adicionales."
					]
				}
			],
			"attachments": [
				{
					"description": "La siguiente imagen representa una simulación preliminar del diseño del laberinto. Para su elaboración, se emplearon las herramientas Mazedgenerator.net y Blender.",
					"url": "/laberinto.png"
				},
				{
					"description": "Esta imagen ilustra la simulación del circuito real que hemos diseñado para evaluar su funcionamiento en un entorno virtual. Esta verificación se llevó a cabo debido a que en la implementación del circuito físico no logramos hacerlo funcionar adecuadamente debido a la insuficiencia de voltaje.",
					"url": "/esquema.png"
				},
				{
					"description": "La imagen adjunta muestra el circuito real que fue implementado durante el taller, utilizando una computadora, microbit, cables, protoboard, un sensor ultrasónico y una batería.",
					"url": "/pruebas.jpg"
				}
			]
		},
		{
			"id": 4,
			"title": "Avance #4",
			"date": "2024/09/20",
			"summary": "Se han realizado avances en la adquisición de componentes y la programación del robot. Se compraron portapilas y se ha trabajado en el funcionamiento del sensor ultrasónico, aunque persisten algunos problemas. Además, se ha explorado la posibilidad de utilizar una tarjeta de expansión para mejorar la conectividad.",
			"tasks": [
				{
					"title": "Diseño y montaje",
					"advancements": [
						"Se adquirieron 2 portapilas de caja (para 3 pilas AAA) y 2 portapilas de broche.",
						"Se continuó con la evaluación de los materiales y componentes necesarios.",
						"Se revisó el diseño del chasis del robot (pendiente)."
					],
					"status": "active"
				},
				{
					"title": "Programación",
					"code": {
						"advancements": [
							"Se programó el código para el sensor ultrasónico, aunque el funcionamiento ha sido problemático. Inicialmente, el circuito no funcionó correctamente debido a las resistencias, las cuales fueron eliminadas, logrando que el sensor funcionara.",
							"Se probó conectar dos sensores en un solo microbit, pero no mostraron valores consistentes."
						],
						"status": "pending"
					},
					"tests": {
						"advancements": [
							"Se realizaron pruebas con el sensor ultrasónico y se observó que, al eliminar las resistencias, se logró un funcionamiento más adecuado, aunque aún presenta fallas."
						],
						"status": "pending"
					}
				}
			],
			"issues": [
				{
					"title": "Descripción de problemas",
					"description": "El sensor ultrasónico sigue teniendo inconsistencias en su funcionamiento, especialmente al utilizar dos sensores en un solo microbit, ya que los valores mostrados son diferentes."
				},
				{
					"title": "Impacto en el proyecto",
					"description": "Se ha retrasado el avance en la programación y en las pruebas del sensor ultrasónico."
				},
				{
					"title": "Acciones tomadas",
					"description": "Se está evaluando la posibilidad de conseguir una tarjeta de expansión para el microbit, lo que podría ayudar a mejorar la conectividad y funcionalidad del proyecto."
				}
			],
			"nextSteps": [
				{
					"title": "Tareas planeadas",
					"advancements": [
						"Continuar con el diseño del chasis del robot.",
						"Evaluar la adquisición de una tarjeta de expansión para el microbit.",
						"Realizar pruebas adicionales con el sensor ultrasónico después de ajustar el circuito.",
						"Proceder con la compra de materiales necesarios y seguir evaluando costos."
					]
				},
				{
					"title": "Cronograma revisado",
					"calendar": [
						{
							"date": "2024/09/27",
							"title": "Adquisición de materiales"
						},
						{
							"date": "2024/10/09",
							"title": "Diseño detallado"
						}
					]
				}
			],
			"resources": [
				{
					"title": "Recursos utilizados",
					"advancements": [
						"https://tinkercad.com/",
						"https://microbit.org/"
					]
				}
			],
			"comments": [
				{
					"title": "Retroalimentación del equipo",
					"advancements": [
						"El equipo sigue enfrentando desafíos con el sensor ultrasónico y aún no tiene el laberinto armado, lo que ha generado preocupaciones sobre el avance del proyecto. El profesor sugirió considerar un objetivo más sencillo, lo que permitiría reducir gastos en materiales y facilitar la conclusión exitosa del proyecto."
					]
				},
				{
					"title": "Sugerencias de mejora",
					"advancements": [
						"Es fundamental resolver los problemas con los sensores antes de continuar con el desarrollo. Además, se debe evaluar la posibilidad de una tarjeta de expansión y asegurar que todos los componentes funcionen de manera óptima antes de realizar nuevas adquisiciones."
					]
				}
			],
			"attachments": [
				{
					"description": "Esta imagen muestra el código que utilizamos para evaluar el funcionamiento del primer circuito con un sensor ultrasónico.",
					"url": "/program_1.png"
				},
				{
					"description": "Esta imagen muestra el código que utilizamos para evaluar el funcionamiento del segundo circuito con los dos sensores ultrasónicos.",
					"url": "/program_2.png"
				},
				{
					"description": "Estas imágenes representan el prototipo del primer circuito que intentamos desarrollar en clase.",
					"url": "/circuit_1.png"
				},
				{
					"description": "Estas imágenes representan el prototipo del primer circuito que intentamos desarrollar en clase.",
					"url": "/real_circuit_1.jpg"
				},
				{
					"description": "Estas imágenes representan el prototipo del primer circuito que intentamos desarrollar en clase.",
					"url": "/real_circuit_2.jpg"
				},
				{
					"description": "Las siguientes imágenes muestran el circuito sin las resistencias, así como la evidencia del correcto funcionamiento del sensor, reflejado en el microbit.",
					"url": "/real_circuit_3.jpg"
				},
				{
					"description": "Las siguientes imágenes muestran el circuito sin las resistencias, así como la evidencia del correcto funcionamiento del sensor, reflejado en el microbit.",
					"url": "/real_circuit_4.jpg"
				}
			]
		},
		{
			"id": 5,
			"title": "Avance #5",
			"date": "2024/09/27",
			"summary": "Hemos avanzado en la compra y prueba de las ruedas con motor, aunque hemos encontrado algunos problemas en el control de los motores y su programación.",
			"tasks": [
				{
					"title": "Diseño y montaje",
					"advancements": [
						"Se conectaron las ruedas a las pilas.",
						"Se probó el circuito con un transistor Tinkercad"
					],
					"status": "active"
				},
				{
					"title": "Programación",
					"code": {
						"title": "Código desarrollado",
						"advancements": [
							"Se utilizó el bloque de código para controlar el motor en Tinkercad."
						],
						"status": "pending"
					},
					"tests": {
						"title": "Pruebas realizadas",
						"advancements": [
							"Se probaron las ruedas en Tinkercad para mover hacia adelante y hacia atrás.",
							"Se intentó aplicar el código a la microbit, pero solo funcionó al mover las ruedas hacia adelante."
						],
						"status": "pending"
					}
				}
			],
			"issues": [
				{
					"title": "Descripción de problemas",
					"description": [
						"No se pudo identificar si el motor arrancaba al conectarlo directamente a las pilas, ya que siempre parecía estar funcionando.",
						"Las ruedas no giraban en sentido contrario a menos que se invirtieran los cables.",
						"Problemas al utilizar cuatro transistores en el circuito, lo que impidió el control del motor con micro:bit."
					]
				},
				{
					"title": "Impacto en el proyecto",
					"description": "Los problemas con la conexión y el control del motor están retrasando el progreso del proyecto."
				},
				{
					"title": "Acciones tomadas",
					"description": "Se intentaron varias configuraciones de conexión, incluyendo cambiar la cantidad de transistores utilizados y probar con diferentes configuraciones en la protoboard."
				}
			],
			"nextSteps": [
				{
					"title": "Tareas planeadas",
					"advancements": [
						"Investigar el uso adecuado de transistores y cómo afectan el circuito.",
						"Probar diferentes configuraciones en la protoboard para lograr el control del motor."
					]
				},
				{
					"title": "Cronograma revisado",
					"calendar": [
						{
							"date": "2024/09/03",
							"title": "Adquisición de materiales"
						},
						{
							"date": "2024/09/04",
							"title": "Diseño detallado"
						}
					]
				}
			],
			"resources": [
				{
					"title": "Recursos utilizados",
					"advancements": [
						"https://tinkercad.com/",
						"https://microbit.org/"
					]
				}
			],
			"comments": [
				{
					"title": "Retroalimentación del equipo",
					"advancements": [
						"El equipo sugiere que es fundamental continuar trabajando en el control del motor para lograr un funcionamiento óptimo. Se recomienda experimentar con diferentes configuraciones de transistores, especialmente al usar transistores con tres patitas, para entender mejor cómo influyen en el circuito y en el comportamiento del motor. También es importante realizar pruebas exhaustivas en la protoboard para identificar posibles problemas de conexión que podrían estar afectando el rendimiento del sistema."
					]
				},
				{
					"title": "Sugerencias de mejora",
					"advancements": [
						"Se sugiere revisar y ajustar el código en la microbit, asegurándose de que la señal se envíe correctamente al motor. Tal vez sería beneficioso documentar cada configuración y resultado para facilitar el proceso de depuración. Por último, se considera útil buscar recursos adicionales o consultar al profesor sobre estrategias para el control inverso del motor, ya que esto es crucial para la funcionalidad del proyecto."
					]
				}
			],
			"attachments": [
				{
					"description": "Imágenes de los bloques de código implementados",
					"url": "/program_3.jpg"
				},
				{
					"description": "Imágenes de los bloques de código implementados",
					"url": "/program_4.jpg"
				},
				{
					"description": "Imágenes de los circuitos empleados en tinkercad",
					"url": "/circuit_2.jpg"
				},
				{
					"description": "Imágenes de los circuitos empleados en tinkercad",
					"url": "/circuit_3.jpg"
				},
				{
					"description": "Imágenes de los circuitos empleados en tinkercad",
					"url": "/circuit_4.jpg"
				},
				{
					"description": "Imágenes del circuito en la protoboard",
					"url": "/real_circuit_5.jpg"
				},
				{
					"description": "Imágenes del circuito en la protoboard",
					"url": "/real_circuit_6.jpg"
				},
				{
					"description": "Imágenes del circuito en la protoboard",
					"url": "/real_circuit_7.jpg"
				},
				{
					"description": "Imágenes del circuito en la protoboard",
					"url": "/real_circuit_8.jpg"
				}
			]
		},
		{
			"id": 6,
			"title": "Avance #6",
			"date": "2024/10/04",
			"summary": "El robot ha sido ensamblado con sus motores, ruedas y circuitos iniciales. Las pruebas básicas demostraron que las ruedas pueden moverse hacia adelante, atrás y girar en círculos. También hemos comenzado a utilizar dos microbits para controlar el robot de forma remota.",
			"tasks": [
				{
					"title": "Diseño y montaje",
					"advancements": [
						"Ensamblaje del chasis del robot, con las dos ruedas traseras y la rueda delantera universal.",
						"Conexión de los motores mediante cables caimanes a la fuente de alimentación.",
						"Pruebas del movimiento de las ruedas hacia adelante y atrás."
					],
					"status": "completed"
				},
				{
					"title": "Programación",
					"code": {
						"title": "Código desarrollado",
						"advancements": [
							"Primer programa para controlar una rueda con transistores, que funcionó correctamente (utilizamos 1).",
							"Modificación del código para controlar las dos ruedas, logrando que se movieran hacia adelante y giraran en círculos.",
							"Programación en la microbit para que los motores se activaran cuando se presionara el botón A.",
							"Comunicación remota entre dos microbits, utilizando radio para controlar el encendido y apagado del circuito."
						],
						"status": "completed"
					},
					"tests": {
						"title": "Pruebas realizadas",
						"advancements": [
							"Ensamblaje del chasis y conexión de los motores a la fuente de alimentación.",
							"Pruebas de movimiento de las ruedas hacia adelante, atrás y giros en círculo.",
							"Verificación de los programas en microbit para controlar los motores.",
							"Prueba de control remoto entre dos microbits, logrando activar y desactivar el circuito a distancia."
						],
						"status": "completed"
					}
				}
			],
			"issues": [
				{
					"title": "Descripción de problemas",
					"description": [
						"Los motores se trababan porque las ruedas se bloqueaban con los cables.",
						"Sospechamos que los motores no estaban bien fijados al chasis, lo que ocasionaba que las ruedas no funcionaran correctamente.",
						"El manejo de cables es desordenado y complicado, debido a la falta de espacio y de cables suficientes."
					]
				},
				{
					"title": "Impacto en el proyecto",
					"description": [
						"Dificultad en las pruebas de movimiento, ya que los motores se trababan o no funcionaban correctamente.",
						"El desorden en el cableado afecta la organización y eficiencia del montaje."
					]
				},
				{
					"title": "Acciones tomadas",
					"description": [
						"Ajustar los motores para que queden mejor fijados.",
						"Planificar la adquisición de más cables y una tarjeta de expansión para la micro:bit."
					]
				}
			],
			"nextSteps": [
				{
					"title": "Tareas planeadas",
					"advancements": [
						"Comprar 3 sensores de seguimiento de línea/proximidad.",
						"Adquirir una tarjeta de expansión para la microbit.",
						"Conseguir más cables caimanes."
					]
				},
				{
					"title": "Cronograma revisado",
					"calendar": [
						{
							"date": "2024/10/11",
							"title": "Compra de los componentes adicionales"
						},
						{
							"date": "2024/10/11",
							"title": "Montaje y optimización del sistema"
						}
					]
				}
			],
			"resources": [
				{
					"title": "Recursos requeridos",
					"advancements": [
						"Sensores de seguimiento de línea o proximidad.",
						"Tarjeta de expansión para la microbit.",
						"Cables caimanes adicionales."
					]
				},
				{
					"title": "Recursos utilizados",
					"advancements": [
						"https://microbit.org/",
						"https://tinkercad.com/"
					]
				}
			],
			"comments": [
				{
					"title": "Retroalimentación del equipo",
					"advancements": [
						"El equipo está satisfecho con el progreso logrado hasta ahora, ya que se ha avanzado en el ensamblaje del chasis, la conexión de los motores, y la implementación básica de control con la micro:bit.",
						"Sin embargo, se han identificado algunas áreas de mejora clave. En cuanto al manejo de cables, el equipo señala que el cableado es desordenado y dificulta las pruebas, lo que incrementa la posibilidad de errores durante las conexiones. Además, se ha observado que los motores no están bien fijados al chasis, lo que pudo haber provocado problemas en la estabilidad del montaje, afectando el rendimiento del robot durante las pruebas de movimiento.",
						"El equipo también ha comentado que la integración de más sensores y componentes electrónicos (como la tarjeta de expansión) podría facilitar futuras implementaciones y mejorar la funcionalidad del robot. En términos generales, se aprecia el avance logrado, pero se ha subrayado la importancia de adquirir los recursos necesarios para resolver estos inconvenientes y optimizar el diseño."
					]
				},
				{
					"title": "Sugerencias de mejora",
					"advancements": [
						"Buscar herramientas adecuadas para mejorar el ensamblaje del chasis y evitar que los motores queden flojos.",
						"Implementar un sistema de gestión de cables para mantener el montaje más ordenado y eficiente."
					]
				}
			],
			"attachments": [
				{
					"description": "Se adjunta foto de la nueva placa utilizada para hacer uso de las ruedas.",
					"url": "/placa_1.jpeg"
				},
				{
					"description": "Se adjunta foto de la placa armada con el robot en funcionamiento.",
					"url": "/pruebas_0.png"
				}
			]
		},
		{
			"id": 7,
			"title": "Avance #7",
			"date": "2024/10/11",
			"summary": "Se intentó probar el movimiento individual de las ruedas hacia adelante y hacia atrás haciendo uso de transistores. También probamos el sensor de seguidor de línea que diferencia entre blanco y negro (chip TCRT500). Además de eso se pudo hacer uso de la tarjeta de expansión de la micro:bit.",
			"tasks": [
				{
					"title": "Diseño y montaje",
					"advancements": [
						"Creación del circuito para controlar ambas direcciones de las ruedas de forma individual usando la tarjeta de expansión.",
						"Conexión de los sensores de seguidor de línea con la micro:bit haciendo uso de la tarjeta de expansión."
					],
					"status": "pending"
				},
				{
					"title": "Programación",
					"code": {
						"title": "Código desarrollado",
						"advancements": [
							"Programa sencillo para controlar las ruedas con los botones A y B de la micro:bit.",
							"Programa sencillo para mostrar un 0 o un 1 dependiendo de si el sensor de seguidor de línea capta el color blanco o el negro."
						],
						"status": "completed"
					},
					"tests": {
						"title": "Pruebas realizadas",
						"advancements": [
							"Intentar manejar las ruedas individualmente creando un circuito usando transistores, resistencias y la tarjeta de expansión.",
							"Intentar manejar las ruedas individualmente usando transistores y resistencias sin la tarjeta de expansión.",
							"Intentar manejar las ruedas individualmente usando transistores sin las resistencias y sin la tarjeta de expansión.",
							"Comprobar que las ruedas funcionan proporcionando corriente directa.",
							"Comprobar el funcionamiento del sensor de seguidor de línea con la tarjeta de expansión."
						],
						"status": "active"
					}
				}
			],
			"issues": [
				{
					"title": "Descripción de problemas",
					"description": [
						"Los motores no funcionaban cuando se intentaba hacer el circuito con los transistores, por razones desconocidas.",
						"El sensor de seguidor de línea no devolvía números enteros a la micro:bit."
					]
				},
				{
					"title": "Impacto en el proyecto",
					"description": "Al no poder implementar el control de las ruedas de manera individual, el avance en el proyecto se retrasó demasiado, ya que era muy importante para avanzar a otras etapas del proyecto."
				},
				{
					"title": "Acciones tomadas",
					"description": [
						"Intentamos probar más formas de que funcione el control de los motores haciendo uso de los transistores y la tarjeta de expansión para poder avanzar a las siguientes etapas, sin éxito.",
						"Se intentó verificar que la tarjeta de expansión funcionaba correctamente, y resultó que sí.",
						"Se verificó que las resistencias no eran un problema a la hora de hacer el circuito.",
						"Se verificó que el circuito funcionaba en la simulación de Tinkercad.",
						"Se corrigió el error del sensor de seguidor de línea redondeando los valores devueltos por el pin de la micro:bit usando la función pull pin to up."
					]
				}
			],
			"nextSteps": [
				{
					"title": "Tareas planeadas",
					"advancements": [
						"Seguir intentando formas de solucionar el problema con las ruedas."
					]
				},
				{
					"title": "Cronograma revisado",
					"calendar": [
						{
							"date": "2024/10/18",
							"title": "Solucionar problema con los motores"
						}
					]
				}
			],
			"resources": [
				{
					"title": "Recursos utilizados",
					"advancements": [
						"https://microbit.org/",
						"https://tinkercad.com/"
					]
				}
			],
			"comments": [
				{
					"title": "Retroalimentación del equipo",
					"advancements": [
						"Es importante señalar que no hubo cambios significativos en el funcionamiento de las ruedas ya que solo los sensores quedaron operativos. La comunicación entre los integrantes del equipo y el enfoque colaborativo serán clave para resolver los problemas presentados. Para la próxima clase nos enfocaremos en encontrar una solución efectiva que nos permita avanzar a las siguientes etapas del proyecto."
					]
				},
				{
					"title": "Sugerencias de mejora",
					"advancements": [
						"Buscar nuevas formas de solucionar el problema de los motores de manera eficiente, sabiendo replicar el problema y buscar las causas de por qué sucede."
					]
				}
			],
			"attachments": [
				{
					"description": "Se adjunta foto tomada en clase del circuito para el funcionamiento de los motores usando transistores.",
					"url": "/real_circuit_10.jpeg"
				},
				{
					"description": "Se adjunta foto de las pruebas con el robot.",
					"url": "/pruebas_3.jpeg"
				},
				{
					"description": "Se adjunta foto del funcionamiento del sensor de seguidor de línea, donde imprime un 0 cuando detecta el color negro o un 1 si detecta el color blanco.",
					"url": "/pruebas_4.jpeg"
				},
				{
					"description": "Se adjunta foto de la tarjeta de expansión de la micro:bit.",
					"url": "/real_circuit_9.jpeg"
				}
			]
		},
		{
			"id": 8,
			"title": "Avance #8",
			"date": "2024/10/18",
			"summary": "Se intentaron encontrar soluciones al problema de que los transistores no funcionaban de la manera correcta, Tanto con la tarjeta de expansión de la micro:bit como sin la misma. Optamos por hacer uso de un microchip en su lugar.",
			"tasks": [
				{
					"title": "Diseño y montaje",
					"advancements": [
						"Recrear el circuito desde cero para probar los transistores en conjunto con los motores.",
						"Probar a usar el microchip como reemplazo de los 8 transistores, para poder manejar los motores."
					],
					"status": "completed"
				},
				{
					"title": "Programación",
					"code": {
						"title": "Código desarrollado",
						"advancements": [
							"Programa sencillo para controlar las ruedas hacia adelante y hacia atrás con los botones A y B de la micro:bit."
						],
						"status": "completed"
					},
					"tests": {
						"title": "Pruebas realizadas",
						"advancements": [
							"Intentar manejar las ruedas individualmente creando un circuito usando transistores, resistencias y la tarjeta de expansión.",
							"Intentar manejar las ruedas individualmente creando un circuito usando transistores y resistencias sin la tarjeta de expansión.",
							"Probar que los transistores transmitan el voltaje correcto.",
							"Intentar manejar las ruedas individualmente creando un circuito usando un microchip y la tarjeta de expansión."
						],
						"status": "completed"
					}
				}
			],
			"issues": [
				{
					"title": "Descripción de problemas",
					"description": [
						"Los motores seguían sin funcionar si se hacía uso de los transistores. Vimos que la principal causa era que los transistores no transmitían el voltaje adecuado, sólo pasaban la conexión a tierra, haciendo imposible el funcionamiento completo de las ruedas, ya que necesitábamos pasar tanto la tierra como la corriente, para poder alternar el movimiento de las ruedas entre adelante y atrás.",
						"El microchip funcionaba bien en un principio, pero luego de un rato las ruedas empezaron a fallar y no registraban los movimientos correctamente por causas desconocidas."
					]
				},
				{
					"title": "Impacto en el proyecto",
					"description": [
						"Esta vez se pudo avanzar bastante más, ya que el poder usar un microchip como alternativa a los 8 transistores que ocupaban mucho espacio y usaban muchos cables, nos facilitó bastante el curso del proyecto.",
						"Aún así, el no poder identificar por qué el microchip no registraba bien el control de las ruedas supuso un atraso, ya que generó un problema más que ver para la siguiente reunión."
					]
				},
				{
					"title": "Acciones tomadas",
					"description": [
						"Verificamos los voltajes recibidos por los transistores usando un multímetro, descubriendo que nos daba valores más bajos de lo esperado.",
						"Buscamos alternativas en la web al uso de los transistores, encontrando que podíamos hacer uso de un microchip, el cual teníamos ya en nuestra propiedad en ese momento.",
						"Se hizo uso del microchip de la manera correcta, siguiendo un diagrama encontrado en línea."
					]
				}
			],
			"nextSteps": [
				{
					"title": "Tareas planeadas",
					"advancements": [
						"Verificar por qué el microchip funcionaba de manera incorrecta algunas veces."
					]
				},
				{
					"title": "Cronograma revisado",
					"calendar": [
						{
							"date": "2024/10/25",
							"title": "Encontrar los problemas con el microchip"
						}
					]
				}
			],
			"resources": [
				{
					"title": "Recursos utilizados",
					"advancements": [
						"https://microbit.org/",
						"https://tinkercad.com/",
						"https://learningdevelopments.co.nz/blogs/troystutorials/micro-bit-dc-motor-control"
					]
				}
			],
			"comments": [
				{
					"title": "Retroalimentación del equipo",
					"advancements": [
						"A pesar de que no se avanzó mucho con el funcionamiento de las ruedas, descubrir que vamos a poder hacer uso del microchip para facilitar las cosas nos da una gran ventaja. No sólo nos ayuda a tener menos cables y todo más organizado, sino que es más fácil a la hora de implementar. La próxima clase tendremos nuestro enfoque en encontrar una solución a los problemas que presenta el microchip e intentaremos avanzar con los sensores de seguidor de línea."
					]
				},
				{
					"title": "Sugerencias de mejora",
					"advancements": [
						"Intentar avanzar más rápido a otras etapas del proyecto, ya que queda poco tiempo para poder terminar con el proyecto."
					]
				}
			],
			"attachments": [
				{
					"description": "Imagen representativa de cómo funciona el microchip",
					"url": "/microchip_circuit_1.png"
				},
				{
					"description": "Imagen de referencia que usamos para hacer el circuito",
					"url": "/microchip_circuit_2.png"
				}
			]
		},
		{
			"id": 9,
			"title": "Avance #9",
			"date": "2024/10/25",
			"summary": "Logramos implementar correctamente el microchip. También hicimos más pruebas con el sensor de seguidor de línea, encontrando otro problema con una posible solución.",
			"tasks": [
				{
					"title": "Diseño y montaje",
					"advancements": [
						"Se conectaron las ruedas por medio del microchip",
						"Se probaron los 3 sensores de seguidor de línea al mismo tiempo."
					],
					"status": "completed"
				},
				{
					"title": "Programación",
					"code": {
						"title": "Código desarrollado",
						"advancements": [
							"Programa sencillo para controlar las ruedas hacia adelante y hacia atrás con los botones A y B de la micro:bit.",
							"Programa para leer las señales de los sensores de seguidor de línea y mostrar cada uno en la pantalla de la micro:bit, dependiendo de si detectaba blanco o negro."
						],
						"status": "completed"
					},
					"tests": {
						"title": "Pruebas realizadas",
						"advancements": [
							"Probar el uso de las ruedas haciendo uso del microchip y la tarjeta de expansión.",
							"Probar la lectura del sensor de seguidor de línea haciendo uso de la tarjeta de expansión."
						],
						"status": "active"
					}
				}
			],
			"issues": [
				{
					"title": "Descripción de problemas",
					"description": [
						"Los motores seguían sin funcionar correctamente, sólo funcionaban a veces, y la mayoría de las veces había que impulsarlos manualmente.",
						"Los sensores de seguidor de línea daban una señal errónea. Creemos que es a causa de la función para redondear valores desde los pines (pull_up o pull_down), ya que no es preciso."
					]
				},
				{
					"title": "Impacto en el proyecto",
					"description": "Como no tenemos 100% funcional los sensores de seguidor de línea, no podemos avanzar con la fase final del proyecto, que sería programar el funcionamiento del robot para que salga del laberinto."
				},
				{
					"title": "Acciones tomadas",
					"description": [
						"Verificamos el voltaje que le estaba llegando al microchip, y descubrimos que estaba muy por debajo de los 9V que deberían llegar, así que decidimos cambiar todas las pilas. Una vez hecho eso, ya no hubieron más problemas con el manejo de los motores.",
						"Intentamos redondear los valores de los sensores de seguidor de línea de diferentes maneras, tanto hacia arriba como hacia abajo, sin éxito.",
						"Intentamos conectar tanto 3 sensores a la vez, como sólo dos o incluso uno, y siempre funcionaban mal, o incluso no funcionaban."
					]
				}
			],
			"nextSteps": [
				{
					"title": "Tareas planeadas",
					"advancements": [
						"Planeamos leer los valores de los sensores de seguidor de línea en análogo en vez de leerlos de manera digital, ya que creemos que eso puede solucionar el problema que tenemos a la hora de leer los valores.",
						"Traer un laberinto impreso para poner el robot en funcionamiento."
					]
				},
				{
					"title": "Cronograma revisado",
					"calendar": [
						{
							"date": "2024/11/01",
							"title": "Solucionar los problemas con los sensores"
						}
					]
				}
			],
			"resources": [
				{
					"title": "Recursos utilizados",
					"advancements": [
						"https://microbit.org/"
					]
				}
			],
			"comments": [
				{
					"title": "Retroalimentación del equipo",
					"advancements": [
						"Al tener claros cuáles fueron los limitantes a la hora de implementar no sólo el microchip sino también los sensores, podemos tener un poco más de control a la hora de realizar el proyecto, sabiendo cuáles cosas funcionan y cuáles no."
					]
				},
				{
					"title": "Sugerencias de mejora",
					"advancements": [
						"Intentar agilizar entre todo el equipo los avances en el proyecto, para poder llegar a la fecha de entrega sin problema."
					]
				}
			],
			"attachments": [
				{
					"description": "Imagen del robot haciendo uso del microchip y los sensores de seguidor de linea",
					"url": "/pruebas_5.png"
				},
				{
					"description": "Imagen de los 3 sensores funcionando haciendo uso de sólo dos pilas de 1,5V",
					"url": "/pruebas_6.png"
				}
			]
		}
	]
}